{
  "auto_mapping": {
    "base_model_class": "EsmForMaskedLM",
    "parent_library": "transformers.models.esm.modeling_esm"
  },
  "base_model_name_or_path": "facebook/esm2_t33_650M_UR50D",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "revision": null,
  "target_modules": [
    "regression",
    "dense",
    "query",
    "decoder",
    "key",
    "value"
  ],
  "task_type": null
}